Revit 2027 API
BuiltInFailures.RebarFailures.RebarDimensionalConstraintLost Property
 Dimensional constraint on Rebar element was lost on upgrade.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RebarDimensionalConstraintLost { get; }
Public Shared ReadOnly Property RebarDimensionalConstraintLost As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RebarDimensionalConstraintLost {
	FailureDefinitionId^ get ();
}
static member RebarDimensionalConstraintLost : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace